tap "alphahydrae/tools"
tap "ankane/brew"
tap "mhaeuser/mhaeuser"
tap "sst/tap"
tap "steveyegge/beads"
tap "stripe/stripe-cli"
tap "zackelia/formulae"
# Library for manipulating PNG images
brew "libpng"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# High performance key/value database
brew "berkeley-db", link: true
# Parser generator
brew "bison"
# GNU multiple precision arithmetic library
brew "gmp"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Assuan IPC Library
brew "libassuan"
# X.509 and CMS library
brew "libksba"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Safely store secrets in Git/Mercurial/Subversion
brew "blackbox"
# Software library to render fonts
brew "freetype"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Generic library support script
brew "libtool"
# Graphics library to dynamically manipulate images
brew "gd"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# NaCl networking and cryptography library
brew "libsodium"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# DDC monitor controls (brightness) for Mac OSX command-line
brew "ddcctl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg@7", link: true
# GNU compiler collection
brew "gcc"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Fulltext search engine and column store
brew "groonga"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Hexagonal hierarchical geospatial indexing system
brew "h3"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# BSD-style licensed readline alternative
brew "libedit"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Conversion library
brew "libiconv"
# Apache Kafka C/C++ library
brew "librdkafka"
# Library to render SVG files using Cairo
brew "librsvg"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Catches mail and serves it through a dream
brew "mailcatcher"
# Deep clean and optimize your Mac
brew "mole"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# App source + Nix packages + Docker = Image
brew "nixpacks"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Highly capable, feature-rich programming language
brew "perl"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# C parser in Python
brew "pycparser"
# Generic machine emulator and virtualizer
brew "qemu"
# Develop and deploy code with zero configuration
brew "railway"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Persistent key-value database, with built-in net interface
brew "redis@6.2", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Image processing library
brew "vips"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Why is this running?
brew "witr"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Wait for TCP endpoints to be reachable
brew "alphahydrae/tools/tcpwait"
# Scan your data stores for unencrypted personal data (PII)
brew "ankane/brew/pdscan"
# AI-supervised issue tracker for coding workflows
brew "steveyegge/beads/bd"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Tools for building Android applications
cask "android-studio"
# Control the platform power state of your Apple Silicon device
cask "mhaeuser/mhaeuser/battery-toolkit"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-adwaita-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-atkynson-mono-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Multi-platform web browser
cask "microsoft-edge"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MySQL/MariaDB database management
cask "sequel-ace"
# Team communication and collaboration software
cask "slack"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# SSH client
cask "termius"
# Open-source code editor
cask "visual-studio-code"
