tap "alphahydrae/tools"
tap "ankane/brew"
tap "homebrew/bundle"
tap "homebrew/services"
brew "zstd"
brew "openssl@3"
brew "protobuf"
brew "autoconf"
brew "automake"
brew "pycparser"
brew "awscli"
brew "berkeley-db", link: true
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libassuan"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "blackbox"
brew "cmake"
brew "colima", restart_service: :changed
brew "coreutils"
brew "libssh2"
brew "rtmpdump"
brew "curl"
brew "ddcctl"
brew "docker"
brew "docker-compose"
brew "docutils"
brew "libsodium"
brew "ffmpeg"
brew "gcc"
brew "fzf"
brew "gawk"
brew "pkgconf"
brew "libtool"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "groonga"
brew "guile"
brew "h3"
brew "htmlq"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libffi"
brew "libfido2"
brew "librdkafka"
brew "libyaml"
brew "luv"
brew "mailcatcher"
brew "moreutils"
brew "zlib"
brew "mysql-client"
brew "neovim"
brew "nixpacks"
brew "openssl@1.1"
brew "ossp-uuid"
brew "tmux"
brew "overmind"
brew "perl"
brew "pex"
brew "qemu"
brew "reattach-to-user-namespace"
brew "redis"
brew "redis@6.2", restart_service: :changed
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "starship"
brew "telnet"
brew "the_silver_searcher"
brew "tree"
brew "vim"
brew "vips"
brew "watchexec"
brew "zsh"
brew "alphahydrae/tools/tcpwait"
brew "ankane/brew/pdscan"
cask "font-fira-mono-nerd-font"
cask "rectangle"
